#### Water Members

---

|  |
| --- |
| Water Class   Properties   See Also |

The  Water  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | CommonTintColor | The property labeled "Tint Color" from the "Water" schema. |
| Public property Static member | CommonTintToggle | The property labeled "Tint" from the "Water" schema. |
| Public property Static member | WaterBumpAmount | The property labeled "Wave Height" from the "Water" schema. |
| Public property Static member | WaterColorByObject | The property labeled "Custom Color" from the "Water" schema. |
| Public property Static member | WaterTintColor | The property labeled "Custom Color" from the "Water" schema. |
| Public property Static member | WaterTintEnable | The property labeled "Color" from the "Water" schema. |
| Public property Static member | WaterType | The property labeled "Type" from the "Water" schema. |

# See Also

Water Class

Autodesk.Revit.DB.Visual Namespace